app/views/articles/_article_card.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", "87a1066b-14e3-4d0b-980d-115cb516e737"]]
---
  <p>
    <strong><%= pluralize article.comments.count, "comment" %></strong>