app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Some article title"], ["content", nil], ["created_at", "2023-10-05 10:21:15.963026"], ["updated_at", "2023-10-05 10:21:15.963026"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "My new article title"], ["updated_at", "2023-10-05 10:29:37.209433"], ["id", "d7825b92-474a-4cd9-b3da-43433ce4f556"]]